uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/ADC_1_FILTER.h
/***************************************************************************//**
* \file     ADC_1_FILTER.c
* \version  1.20
*
* \brief
* Provides filter defines to the API for the ADC_1 Component.
*
********************************************************************************
* \copyright
* (c) 2015-2016, Cypress Semiconductor Corporation. All rights reserved.
* This software, including source code, documentation and related
* materials ("Software"), is owned by Cypress Semiconductor
* Corporation ("Cypress") and is protected by and subject to worldwide
* patent protection (United States and foreign), United States copyright
* laws and international treaty provisions. Therefore, you may use this
* Software only as provided in the license agreement accompanying the
* software package from which you obtained this Software ("EULA").
* If no EULA applies, Cypress hereby grants you a personal, nonexclusive,
* non-transferable license to copy, modify, and compile the
* Software source code solely for use in connection with Cypress's
* integrated circuit products. Any reproduction, modification, translation,
* compilation, or representation of this Software except as specified
* above is prohibited without the express written permission of Cypress.
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO
* WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING,
* BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
* PARTICULAR PURPOSE. Cypress reserves the right to make
* changes to the Software without notice. Cypress does not assume any
* liability arising out of the application or use of the Software or any
* product or circuit described in the Software. Cypress does not
* authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer
* of such system or application assumes all risk of such use and in doing
* so agrees to indemnify Cypress against all liability.
*******************************************************************************/

#if !defined(CY_ADC_1_FILTER_H)
    #define CY_ADC_1_FILTER_H

    
#define ADC_1_FILTER_CFG0_FILTER_PRESENT          (1uL)
#define ADC_1_FILTER_CFG1_FILTER_PRESENT          (0uL)
#define ADC_1_FILTER_CFG2_FILTER_PRESENT          (0uL)
#define ADC_1_FILTER_CFG3_FILTER_PRESENT          (0uL)
	
#define ADC_1_FILTER_ANY_CONFIG_USES_FILTER       ( ADC_1_FILTER_CFG0_FILTER_PRESENT \
                                                             | ADC_1_FILTER_CFG1_FILTER_PRESENT \
                                                             | ADC_1_FILTER_CFG2_FILTER_PRESENT \
                                                             | ADC_1_FILTER_CFG3_FILTER_PRESENT \
                                                             )
	

#if(ADC_1_FILTER_ANY_CONFIG_USES_FILTER	!= 0u)	
    
#include "ADC_1_UABH_A_CyUAB_types.h"
#include "ADC_1_UABH_A_CyUAB_regs.h"
#include "ADC_1_UABH_A_CyUAB.h"
#include "ADC_1_UABH_A_param.h"
#include "ADC_1_UABH_B_param.h"
#include "ADC_1_UABH_A_regs.h"
#include "ADC_1_UABH_B_regs.h"
#include "ADC_1_UABH_A.h"
#include "ADC_1_UABH_B.h"

/*******************************************************************************
* Filter function prototypes
*******************************************************************************/
void ADC_1_TrimFilterVos(void);
void ADC_1_filterInit(uint32 configNum);

/*******************************************************************************
* Filter trim constants and macros
*******************************************************************************/
#define ADC_1_OPAMP_TRIM_POS_BASE     (0x00uL)
#define ADC_1_OPAMP_TRIM_POS_LIMIT    (0x08uL)
#define ADC_1_OPAMP_TRIM_NEG_BASE     (ADC_1_OPAMP_TRIM_POS_LIMIT)
#define ADC_1_OPAMP_TRIM_NEG_LIMIT    (0x10uL)
#define ADC_1_OPAMP_TRIM_MASK         (0x0fuL)
    
#define ADC_1_AGND_TRIM_POS_BASE      (0x00uL)
#define ADC_1_AGND_TRIM_POS_LIMIT     (0x10uL)
#define ADC_1_AGND_TRIM_NEG_BASE      (ADC_1_AGND_TRIM_POS_LIMIT)
#define ADC_1_AGND_TRIM_NEG_LIMIT     (0x20uL)
#define ADC_1_AGND_TRIM_MASK          (0x1fuL)

/*******************************************************************************
* Filter Parameters
*******************************************************************************/
#define ADC_1_FILTERTOPOLOGY_HIGH_Q  (0u)
#define ADC_1_FILTERTOPOLOGY_LOW_Q   (1u)
    
#define ADC_1_TRANSFERTYPE_LOW_PASS (0u)
#define ADC_1_TRANSFERTYPE_HIGH_PASS (1u)
#define ADC_1_TRANSFERTYPE_BAND_PASS (2u)
#define ADC_1_TRANSFERTYPE_BAND_STOP (3u)


#define ADC_1_UABH_A_INVAR_SRAM_CTRL        ((uint32)((uint32)1u << CyUAB_TRIGGER_EN_SHIFT) \
                                                    |  (uint32)((uint32)31u << CyUAB_TRIG_SEL_SHIFT)   \
                                                    |  (uint32)((uint32)1u << CyUAB_LAST_STEP_SHIFT))
#define ADC_1_UABH_B_INVAR_SRAM_CTRL        ((uint32)((uint32)1u << CyUAB_TRIGGER_EN_SHIFT) \
                                                    |  (uint32)((uint32)31u << CyUAB_TRIG_SEL_SHIFT)   \
                                                    |  (uint32)((uint32)1u << CyUAB_LAST_STEP_SHIFT))
#define ADC_1_UABH_A_INVAR_SW_MODBIT_SRC    ((31uL << CyUAB_MODBIT0_SRC_SEL_SHIFT) \
                                                    |  (31uL << CyUAB_MODBIT1_SRC_SEL_SHIFT))
#define ADC_1_UABH_B_INVAR_SW_MODBIT_SRC    ((31uL << CyUAB_MODBIT0_SRC_SEL_SHIFT) \
                                                    |  (31uL << CyUAB_MODBIT1_SRC_SEL_SHIFT))


/*******************************************************************************
* Low-Q definitions
*******************************************************************************/

#define ADC_1_UABH_A_LOWQSTAT_SW_CA_IN0 (CyUAB_SW_CLOSED << CyUAB_SW_AP_SHIFT)
#define ADC_1_UABH_A_LOWQSTAT_SW_CA_TOP (CyUAB_SW_CLOSED << CyUAB_SW_SA_SHIFT)
#define ADC_1_UABH_A_LOWQSTAT_SW_CC_IN0 (CyUAB_CLK_PHI1  << CyUAB_SW_CQ_SHIFT)
#define ADC_1_UABH_A_LOWQSTAT_SW_CC_IN1 (CyUAB_CLK_PHI2  << CyUAB_SW_CG_MODBIT_SHIFT)
#define ADC_1_UABH_A_LOWQSTAT_SW_CF_BOT (CyUAB_SW_CLOSED << CyUAB_SW_PF_SHIFT)
#define ADC_1_UABH_B_LOWQSTAT_SW_CA_IN0 (CyUAB_CLK_PHI2  << CyUAB_SW_AP_SHIFT)
#define ADC_1_UABH_B_LOWQSTAT_SW_CA_IN1 (CyUAB_CLK_PHI1  << CyUAB_SW_AG_MODBIT_SHIFT)
#define ADC_1_UABH_B_LOWQSTAT_SW_CA_TOP ((CyUAB_CLK_PHI2  << CyUAB_SW_SA_SHIFT) \
                                                 | (CyUAB_CLK_PHI1  << CyUAB_SW_GA_MODBIT_SHIFT))
#define ADC_1_UABH_B_LOWQSTAT_SW_CB_IN0 (CyUAB_CLK_PHI1  << CyUAB_SW_BQ_SHIFT)
#define ADC_1_UABH_B_LOWQSTAT_SW_CB_IN1 (CyUAB_CLK_PHI2  << CyUAB_SW_BG_MODBIT_SHIFT)
#define ADC_1_UABH_B_LOWQSTAT_SW_CB_TOP ((CyUAB_CLK_PHI2 << CyUAB_SW_SB_SHIFT) \
                                                 | (CyUAB_CLK_PHI1  << CyUAB_SW_GB_MODBIT_SHIFT) \
                                                 | (CyUAB_SW_CLOSED << CyUAB_SW_TB_SHIFT))
#define ADC_1_UABH_B_LOWQSTAT_SW_CC_IN0 ((uint32)CyUAB_CLK_PHI12 << (ADC_1_UABH_B_halfuab__X0 << 2u))
#define ADC_1_UABH_B_LOWQSTAT_SW_CC_IN1 (CyUAB_CLK_PHI11 << CyUAB_SW_CG_MODBIT_SHIFT)
#define ADC_1_UABH_B_LOWQSTAT_SW_CF_BOT ((CyUAB_SW_CLOSED << CyUAB_SW_PF_SHIFT) \
                                                 |  (CyUAB_CLK_PHI3  << CyUAB_SW_PO_SHIFT))

