uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/ADC_1_FILTER.h
/*******************************************************************************
* High-Q definitions
*******************************************************************************/

#define ADC_1_UABH_A_HIGHQSTAT_SW_CA_IN0 (CyUAB_SW_CLOSED << CyUAB_SW_AQ_SHIFT)
#define ADC_1_UABH_A_HIGHQSTAT_SW_CA_TOP (CyUAB_SW_CLOSED << CyUAB_SW_SA_SHIFT)
#define ADC_1_UABH_A_HIGHQSTAT_SW_CB_IN0 (CyUAB_CLK_PHI1 << CyUAB_SW_BQ_SHIFT)
#define ADC_1_UABH_A_HIGHQSTAT_SW_CB_IN1 (CyUAB_CLK_PHI2 << CyUAB_SW_BG_MODBIT_SHIFT)
#define ADC_1_UABH_A_HIGHQSTAT_SW_CC_IN0 (CyUAB_CLK_PHI12 << (ADC_1_UABH_A_halfuab__X0 << 2u))
#define ADC_1_UABH_A_HIGHQSTAT_SW_CC_IN1 (CyUAB_CLK_PHI11 << CyUAB_SW_CG_MODBIT_SHIFT)
#define ADC_1_UABH_A_HIGHQSTAT_SW_CC_TOP ((CyUAB_SW_CLOSED << CyUAB_SW_TC_SHIFT) \
                                                |    (CyUAB_SW_CLOSED << CyUAB_SW_SC_SHIFT))
#define ADC_1_UABH_A_HIGHQSTAT_SW_CF_BOT (CyUAB_SW_CLOSED << CyUAB_SW_PF_SHIFT)
#define ADC_1_UABH_B_HIGHQSTAT_SW_CA_IN0 (CyUAB_CLK_PHI1 << CyUAB_SW_AQ_SHIFT)
#define ADC_1_UABH_B_HIGHQSTAT_SW_CA_IN1 (CyUAB_CLK_PHI2 << CyUAB_SW_AG_MODBIT_SHIFT)
#define ADC_1_UABH_B_HIGHQSTAT_SW_CA_TOP ((CyUAB_CLK_PHI1 << CyUAB_SW_GA_MODBIT_SHIFT) \
                                                |    (CyUAB_CLK_PHI2 << CyUAB_SW_SA_SHIFT))

#define ADC_1_UABH_B_HIGHQSTAT_SW_CB_IN0 (CyUAB_CLK_PHI12 << (ADC_1_UABH_B_halfuab__X0 << 2u))
#define ADC_1_UABH_B_HIGHQSTAT_SW_CB_IN1 (CyUAB_CLK_PHI11 << CyUAB_SW_BG_MODBIT_SHIFT)

#define ADC_1_UABH_B_HIGHQSTAT_SW_CC_IN0 (CyUAB_CLK_PHI10 << (ADC_1_UABH_B_halfuab__X0 << 2u))
#define ADC_1_UABH_B_HIGHQSTAT_SW_CC_IN1 (CyUAB_CLK_PHI9 << CyUAB_SW_CG_MODBIT_SHIFT)

#define ADC_1_UABH_B_HIGHQSTAT_SW_CF_BOT ((CyUAB_SW_CLOSED << CyUAB_SW_PF_SHIFT) \
                                                 |   (CyUAB_CLK_PHI3  << CyUAB_SW_PO_SHIFT))


/*******************************************************************************
* CFG0 definitions
*******************************************************************************/
#if (0u != ADC_1_FILTER_CFG0_FILTER_PRESENT)
    
    #define ADC_1_CFG0_FILTERTYPE_USED   ADC_1_FILTERTOPOLOGY_LOW_Q
    #define ADC_1_CFG0_TRANSFERTYPE_0   ADC_1_FILTERTOPOLOGY_LOW_PASS
    /* Capacitors that can be fractional should have *
     * a numerator 0-63 and a denominator 1 or 64.   *
     * CA may have a value 1-127.                    *
     * CB may only have a value 2-64                 */

    #define ADC_1_CFG0_FILTER_GT_C1_NUMERATOR_VAL    (3ul)
    #define ADC_1_CFG0_FILTER_GT_C1_DENOMINATOR_VAL  (1ul)
    #define ADC_1_CFG0_FILTER_GT_C2_NUMERATOR_VAL    (3ul)
    #define ADC_1_CFG0_FILTER_GT_C2_DENOMINATOR_VAL  (1ul) 
    #define ADC_1_CFG0_FILTER_GT_C3_VAL              (2ul)      
    #define ADC_1_CFG0_FILTER_GT_C4_VAL              (2ul)      
    #define ADC_1_CFG0_FILTER_GT_Cp_VAL              (0ul)      
    #define ADC_1_CFG0_FILTER_GT_Cpp_NUMERATOR_VAL   (1ul)  
    #define ADC_1_CFG0_FILTER_GT_Cpp_DENOMINATOR_VAL (1ul)  
    #define ADC_1_CFG0_FILTER_GT_CA_VAL              (115ul)      
    #define ADC_1_CFG0_FILTER_GT_CB_VAL              (34ul)     

    #define ADC_1_CFG0_FILTER_IDEAL_BIQUAD_NUM0      (0.039030847500794)
    #define ADC_1_CFG0_FILTER_IDEAL_BIQUAD_NUM1      (-0.0763558596750173)
    #define ADC_1_CFG0_FILTER_IDEAL_BIQUAD_NUM2      (0.039030847500794)
    #define ADC_1_CFG0_FILTER_IDEAL_BIQUAD_DEN0      (0.944703442685866)
    #define ADC_1_CFG0_FILTER_IDEAL_BIQUAD_DEN1      (-1.9429976073593)
    #define ADC_1_CFG0_FILTER_IDEAL_BIQUAD_DEN2      (1)

    #define ADC_1_CFG0_FILTER_UAB_BIQUAD_NUM0        (0.0277777777777778)
    #define ADC_1_CFG0_FILTER_UAB_BIQUAD_NUM1        (-0.0541062801932367)
    #define ADC_1_CFG0_FILTER_UAB_BIQUAD_NUM2        (0.0277777777777778)
    #define ADC_1_CFG0_FILTER_UAB_BIQUAD_DEN0        (0.944444444444444)
    #define ADC_1_CFG0_FILTER_UAB_BIQUAD_DEN1        (-1.94299516908213)
    #define ADC_1_CFG0_FILTER_UAB_BIQUAD_DEN2        (1)
    
    #define ADC_1_CFG0_UABH_A_STARTUP_DELAY    ((uint32)((uint32)13u << CyUAB_STARTUP_DELAY_SHIFT))
    #define ADC_1_CFG0_UABH_B_STARTUP_DELAY    ((uint32)((uint32)13u << CyUAB_STARTUP_DELAY_SHIFT))
    
    #if (ADC_1_CFG0_FILTERTYPE_USED == ADC_1_FILTERTOPOLOGY_LOW_Q)
        /*  C1 = Bbranch
         *  C2 = Cbranch
         *  CA = Abranch + Fbranch */
        #define ADC_1_CFG0_UABH_A_LOWQDYN_CAP_B_VAL    ((0u < ADC_1_CFG0_FILTER_GT_C1_NUMERATOR_VAL) \
                                                           ? ((64u == ADC_1_CFG0_FILTER_GT_C1_NUMERATOR_VAL) \
                                                             ? (uint32)((uint32)1u << CyUAB_CB_64_SHIFT) \
                                                             : (uint32)(ADC_1_CFG0_FILTER_GT_C1_NUMERATOR_VAL << CyUAB_CB_VAL_SHIFT)) \
                                                           : ((64u == ADC_1_CFG0_FILTER_GT_Cp_VAL) \
                                                             ? (uint32)((uint32)1u << CyUAB_CB_64_SHIFT) \
                                                             : (uint32)(ADC_1_CFG0_FILTER_GT_Cp_VAL << CyUAB_CB_VAL_SHIFT)))
        #define ADC_1_CFG0_UABH_A_LOWQDYN_CAP_C_VAL ((uint32)(ADC_1_CFG0_FILTER_GT_C2_NUMERATOR_VAL << CyUAB_CC_VAL_SHIFT))
        #define ADC_1_CFG0_UABH_A_LOWQDYN_CAP_F_VAL_PRE (ADC_1_CFG0_FILTER_GT_CA_VAL/4u)
        #define ADC_1_CFG0_UABH_A_LOWQDYN_CAP_F_VAL ((uint32)(ADC_1_CFG0_UABH_A_LOWQDYN_CAP_F_VAL_PRE << CyUAB_CF_VAL_SHIFT))
        #define ADC_1_CFG0_UABH_A_LOWQDYN_CAP_A_VAL ((uint32)((ADC_1_CFG0_FILTER_GT_CA_VAL - (2u * (ADC_1_CFG0_UABH_A_LOWQDYN_CAP_F_VAL_PRE + 1u))) << CyUAB_CA_VAL_SHIFT))

        #define ADC_1_CFG0_UABH_A_LOWQDYN_CAP_ABCF_VAL ((ADC_1_CFG0_UABH_A_LOWQDYN_CAP_A_VAL) \
                                                           |  (ADC_1_CFG0_UABH_A_LOWQDYN_CAP_B_VAL) \
                                                           |  (ADC_1_CFG0_UABH_A_LOWQDYN_CAP_C_VAL) \
                                                           |  (ADC_1_CFG0_UABH_A_LOWQDYN_CAP_F_VAL))
        /* C3  = Bbranch
         * C4  = Abranch
         * Cpp = Cbranch
         * CB  = Fbranch */
        #define ADC_1_CFG0_UABH_B_LOWQDYN_CAP_ABCF_VAL (((64u == ADC_1_CFG0_FILTER_GT_C3_VAL) \
                                                              ? (uint32)((uint32)1u << CyUAB_CB_64_SHIFT) \
                                                              : (uint32)(ADC_1_CFG0_FILTER_GT_C3_VAL << CyUAB_CB_VAL_SHIFT))          \
                                                       | (uint32)(ADC_1_CFG0_FILTER_GT_C4_VAL            << CyUAB_CA_VAL_SHIFT)    \
                                                       | (uint32)(ADC_1_CFG0_FILTER_GT_Cpp_NUMERATOR_VAL << CyUAB_CC_VAL_SHIFT)  \
                                                       | (uint32)((uint32)((ADC_1_CFG0_FILTER_GT_CB_VAL / 2u) - 1u)  << CyUAB_CF_VAL_SHIFT))


