uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/ADC_1_FILTER.h
    /*******************************************************************************
    * CFG1 High-Q definitions
    *******************************************************************************/
        
    #elif (ADC_1_CFG1_FILTERTYPE_USED == ADC_1_FILTERTOPOLOGY_HIGH_Q)
        /*  C4 = Abranch  *
         *  C2 = Bbranch  *
         *  Cp = Cbranch  *
         *  CA = Fbranch  */
        #define ADC_1_CFG1_UABH_A_HIGHQDYN_CAP_ABCF_VAL (((64u == ADC_1_CFG1_FILTER_GT_C2_NUMERATOR_VAL) \
                                                              ? ((uint32)1u << CyUAB_CB_64_SHIFT) \
                                                              : (ADC_1_CFG1_FILTER_GT_C2_NUMERATOR_VAL << CyUAB_CB_VAL_SHIFT)) \
                                                            | (ADC_1_CFG1_FILTER_GT_Cp_VAL << CyUAB_CC_VAL_SHIFT)           \
                                                            | (ADC_1_CFG1_FILTER_GT_C4_VAL << CyUAB_CA_VAL_SHIFT)           \
                                                            | ((uint32)((ADC_1_CFG1_FILTER_GT_CA_VAL / 2u) - 1u) << CyUAB_CF_VAL_SHIFT))
        /* C3  = Abranch
         * Cpp = Bbranch
         * C1  = Cbranch
         * CB  = Fbranch */
        #define ADC_1_CFG1_UABH_B_HIGHQDYN_CAP_ABCF_VAL (((64u == ADC_1_CFG1_FILTER_GT_Cpp_NUMERATOR_VAL) \
                                                              ? ((uint32)1u << CyUAB_CB_64_SHIFT) \
                                                              : (ADC_1_CFG1_FILTER_GT_Cpp_NUMERATOR_VAL << CyUAB_CB_VAL_SHIFT)) \
                                                       | (ADC_1_CFG1_FILTER_GT_C3_VAL            << CyUAB_CA_VAL_SHIFT)      \
                                                       | (ADC_1_CFG1_FILTER_GT_C1_NUMERATOR_VAL << CyUAB_CC_VAL_SHIFT)       \
                                                       | ((uint32)((ADC_1_CFG1_FILTER_GT_CB_VAL / 2u) - 1u) << CyUAB_CF_VAL_SHIFT))


        #define ADC_1_CFG1_UABH_A_HIGHQDYN_SW_CB_TOP ((CyUAB_CLK_PHI1 << CyUAB_SW_SB_SHIFT) \
                                                        |  (CyUAB_CLK_PHI2 << CyUAB_SW_GB_MODBIT_SHIFT)  \
                                                        |  ((1u < ADC_1_CFG1_FILTER_GT_C2_DENOMINATOR_VAL) \
                                                            ? (CyUAB_CLK_PHI2 << CyUAB_SW_TB_SHIFT) \
                                                            : (CyUAB_SW_CLOSED << CyUAB_SW_TB_SHIFT)))

        #define ADC_1_CFG1_UABH_B_HIGHQDYN_SW_CB_TOP ((CyUAB_SW_CLOSED << CyUAB_SW_SB_SHIFT) \
                                                        |  ((1u < ADC_1_CFG1_FILTER_GT_Cpp_DENOMINATOR_VAL) \
                                                            ? (CyUAB_SW_OPEN << CyUAB_SW_TB_SHIFT) \
                                                            : (CyUAB_SW_CLOSED << CyUAB_SW_TB_SHIFT)))
        #define ADC_1_CFG1_UABH_B_HIGHQDYN_SW_CC_TOP ((CyUAB_CLK_PHI1 << CyUAB_SW_ZC_SHIFT) \
                                                        |  ((CyUAB_CLK_PHI2 << CyUAB_SW_GC_MODBIT_SHIFT)) \
                                                        |  ((1u < ADC_1_CFG1_FILTER_GT_C1_DENOMINATOR_VAL) \
                                                            ? (CyUAB_CLK_PHI2 << CyUAB_SW_TC_SHIFT) \
                                                            : (CyUAB_SW_CLOSED << CyUAB_SW_TC_SHIFT)))

        #define ADC_1_CFG1_UABH_A_HIGHQDYN_CAP_CTRL ((1u < ADC_1_CFG1_FILTER_GT_C2_DENOMINATOR_VAL) \
                                                            ? ((uint32)1u << CyUAB_CB_GND_SHIFT)     \
                                                            : 0u )
        
        #define ADC_1_CFG1_UABH_B_HIGHQDYN_CAP_CTRL (((1u < ADC_1_CFG1_FILTER_GT_Cpp_DENOMINATOR_VAL)    \
                                                            ? ((uint32)1u << CyUAB_CB_GND_SHIFT)   \
                                                            : 0u) \
                                                        | ((1u < ADC_1_CFG1_FILTER_GT_C1_DENOMINATOR_VAL)    \
                                                            ? ((uint32)1u << CyUAB_CC_GND_SHIFT)   \
                                                            : 0u))
        
    #endif /*(ADC_1_CFG1_FILTERTYPE_USED == ADC_1_FILTERTOPOLOGY_LOW_Q)*/
#endif /* (0u != ADC_1_FILTER_CFG1_FILTER_PRESENT) */

/*******************************************************************************
* CFG2 definitions
*******************************************************************************/
#if (0u != ADC_1_FILTER_CFG2_FILTER_PRESENT)
    
    #define ADC_1_CFG2_FILTERTYPE_USED   ADC_1_FILTERTOPOLOGY_
    #define ADC_1_CFG2_TRANSFERTYPE_0   ADC_1_FILTERTOPOLOGY_
    /* Capacitors that can be fractional should have *
     * a numerator 0-63 and a denominator 1 or 64.   *
     * CA may have a value 1-127.                    *
     * CB may only have a value 2-64                 */

    #define ADC_1_CFG2_FILTER_GT_C1_NUMERATOR_VAL    (ul)
    #define ADC_1_CFG2_FILTER_GT_C1_DENOMINATOR_VAL  (ul)
    #define ADC_1_CFG2_FILTER_GT_C2_NUMERATOR_VAL    (ul)
    #define ADC_1_CFG2_FILTER_GT_C2_DENOMINATOR_VAL  (ul) 
    #define ADC_1_CFG2_FILTER_GT_C3_VAL              (ul)      
    #define ADC_1_CFG2_FILTER_GT_C4_VAL              (ul)      
    #define ADC_1_CFG2_FILTER_GT_Cp_VAL              (ul)      
    #define ADC_1_CFG2_FILTER_GT_Cpp_NUMERATOR_VAL   (ul)  
    #define ADC_1_CFG2_FILTER_GT_Cpp_DENOMINATOR_VAL (ul)  
    #define ADC_1_CFG2_FILTER_GT_CA_VAL              (ul)      
    #define ADC_1_CFG2_FILTER_GT_CB_VAL              (ul)     

    #define ADC_1_CFG2_FILTER_IDEAL_BIQUAD_NUM0      ()
    #define ADC_1_CFG2_FILTER_IDEAL_BIQUAD_NUM1      ()
    #define ADC_1_CFG2_FILTER_IDEAL_BIQUAD_NUM2      ()
    #define ADC_1_CFG2_FILTER_IDEAL_BIQUAD_DEN0      ()
    #define ADC_1_CFG2_FILTER_IDEAL_BIQUAD_DEN1      ()
    #define ADC_1_CFG2_FILTER_IDEAL_BIQUAD_DEN2      ()

    #define ADC_1_CFG2_FILTER_UAB_BIQUAD_NUM0        ()
    #define ADC_1_CFG2_FILTER_UAB_BIQUAD_NUM1        ()
    #define ADC_1_CFG2_FILTER_UAB_BIQUAD_NUM2        ()
    #define ADC_1_CFG2_FILTER_UAB_BIQUAD_DEN0        ()
    #define ADC_1_CFG2_FILTER_UAB_BIQUAD_DEN1        ()
    #define ADC_1_CFG2_FILTER_UAB_BIQUAD_DEN2        ()
    
    #define ADC_1_CFG2_UABH_A_STARTUP_DELAY    ((uint32)((uint32)u << CyUAB_STARTUP_DELAY_SHIFT))
    #define ADC_1_CFG2_UABH_B_STARTUP_DELAY    ((uint32)((uint32)u << CyUAB_STARTUP_DELAY_SHIFT))
    
